<script setup>
import TheFooter from "@/components/TheFooter.vue";
import TheSpotsFore from "@/components/TheSpotsFore.vue";
import PageTitle from "@/components/PageTitle.vue";
import PageSteps from "@/components/PageSteps.vue";
import TheExpertise from "@/components/TheExpertise.vue";
import DevCase from "@/components/DevCase.vue";

import { DataDev } from "@/stores/data-dev";
import { onMounted } from "vue";
const dataDev = DataDev();
onMounted(() => {
  dataDev.arcHeaders == 0 || dataDev.stepsDev == 0 || dataDev.arcFooters == 0
    ? dataDev.getDevData()
    : "";
});
</script>

<template>
  <main class="development">
    <PageTitle
      pageTitle="Разработка приложений"
      pageDescription="Индивидуальные продукты, адаптированные к уникальным потребностям вашего бизнеса"
      pageIcon='<svg xmlns="http://www.w3.org/2000/svg" width="476" height="640" viewBox="0 0 476 640" fill="none"><path d="M632.888 331.396L406.519 557.764C403.896 560.355 400.484 561.997 396.822 562.43C393.161 562.862 389.459 562.061 386.304 560.152C383.15 558.244 380.722 555.337 379.406 551.893C378.09 548.449 377.961 544.664 379.039 541.138L490.654 188.285C491.505 185.577 493.04 183.135 495.11 181.194C497.18 179.253 499.716 177.879 502.472 177.204C505.229 176.529 508.112 176.576 510.845 177.341C513.578 178.106 516.067 179.563 518.072 181.571L632.888 296.387C637.448 301.072 640 307.353 640 313.891C640 320.43 637.448 326.71 632.888 331.396ZM233.481 69.9557L7.11269 296.387C2.55198 301.072 0 307.353 0 313.891C0 320.43 2.55198 326.71 7.11269 331.396L121.928 446.211C123.933 448.219 126.423 449.676 129.155 450.441C131.888 451.206 134.772 451.254 137.528 450.579C140.284 449.904 142.82 448.529 144.89 446.588C146.96 444.647 148.495 442.205 149.346 439.498L260.961 86.6448C262.063 83.114 261.951 79.3162 260.644 75.8564C259.336 72.3966 256.909 69.4739 253.747 67.554C250.586 65.6342 246.873 64.8277 243.2 65.2629C239.527 65.6982 236.106 67.3502 233.481 69.9557ZM419.695 0H382.051C375.048 0.0227628 368.235 2.27209 362.596 6.42264C356.956 10.5732 352.783 16.4099 350.68 23.0886L177.391 569.936C175.574 575.704 175.373 581.859 176.811 587.733C178.249 593.607 181.271 598.975 185.547 603.251L202.801 620.504C205.099 622.801 207.829 624.621 210.833 625.859C213.837 627.097 217.056 627.73 220.305 627.72H257.95C264.946 627.711 271.758 625.474 277.398 621.334C283.039 617.195 287.214 611.366 289.32 604.694L462.296 57.8468C464.118 52.0693 464.322 45.9027 462.883 40.0177C461.445 34.1327 458.421 28.7547 454.139 24.4688L437.137 7.27793C432.516 2.63748 426.243 0.0199558 419.695 0Z" fill="#E0E0E0"/></svg>'
    />

    <TheSpotsFore
      pageSlogan="Сфокусируйтесь на главном. Автоматизируйте все остальное."
    />

    <div class="wrapper">
      <div class="content product_dev">
        <h4 class="product_h4">Цифровое воплощение</h4>
        <PageSteps
          :arcHeaders="dataDev.arcHeaders"
          :stepsDev="dataDev.stepsDev"
          :arcFooters="dataDev.arcFooters"
        />

        <div class="experience">
          <!-- <h5>Иновационные решения</h5>
          <p>
            Решения на основе инновационных технологий и ИИ, индивидуально
            адаптированные под Вас для увеличения эффективности бизнеса и
            прибыли компании
          </p>-->
          <h3>Наша экспертность в автоматизации</h3>
          <TheExpertise />
        </div>

        <section class="word_case">
          <h2>От слов к делу</h2>
          <h3>Кейсы</h3>
          <div class="cases">
            <DevCase />
          </div>
        </section>
      </div>
    </div>
  </main>

  <TheFooter />
</template>
