<script setup>
import TheHeader from '@/components/TheHeader.vue';
import TheFooter from '@/components/TheFooter.vue';
</script>

<template>
    <TheHeader />

    <main>

<div class="wrapper-pl">
    <div class="product_dev header_product_dev">
        <div class="left_product_dev">
            <h1 class="title_product_dev">Разработка продукта</h1>
            <h4 class="description_product_dev">
                Индивидуальные продукты, адаптированные к уникальным потребностям вашего бизнеса
            </h4>
        </div>
        <div class="right_product_dev">
            <svg xmlns="http://www.w3.org/2000/svg" width="585" height="648" viewBox="0 0 585 648" fill="none">
                <path
                    d="M328.899 9.61988C329.684 6.97775 331.31 4.66359 333.528 3.02812C335.747 1.39264 338.439 0.524927 341.195 0.556496H435.504C438.175 0.575036 440.805 1.21868 443.183 2.43586C445.561 3.65305 447.621 5.40998 449.198 7.56604C450.775 9.72211 451.825 12.2174 452.265 14.8522C452.704 17.487 452.521 20.1882 451.729 22.7395L431.448 86.8166C430.56 89.5998 428.973 92.1084 426.837 94.1017C424.702 96.0949 422.09 97.5059 419.252 98.1995C416.414 98.893 413.446 98.8458 410.632 98.0622C407.817 97.2787 405.251 95.7852 403.18 93.725L332.068 22.6761C330.37 21.0154 329.172 18.9108 328.611 16.6023C328.051 14.2939 328.151 11.8745 328.899 9.61988ZM154.478 561.025L134.196 625.546C133.402 628.094 133.218 630.792 133.657 633.424C134.097 636.057 135.148 638.549 136.726 640.701C138.305 642.852 140.366 644.603 142.745 645.813C145.123 647.023 147.753 647.657 150.421 647.666H244.731C247.479 647.701 250.164 646.843 252.382 645.219C254.599 643.596 256.229 641.296 257.026 638.666C257.774 636.411 257.874 633.992 257.314 631.683C256.754 629.375 255.556 627.27 253.857 625.609L182.745 554.497C180.704 552.415 178.161 550.893 175.361 550.078C172.561 549.264 169.598 549.184 166.758 549.846C163.918 550.508 161.297 551.89 159.146 553.859C156.995 555.829 155.387 558.318 154.478 561.089V561.025ZM198.527 32.4366C152.474 47.4102 110.619 73.0696 76.3828 107.317C42.1464 141.564 16.5005 183.428 1.54175 229.485C0.416386 233.115 0.536486 237.018 1.88294 240.572C3.22939 244.127 5.72485 247.129 8.97314 249.103C12.2214 251.077 16.0362 251.908 19.8113 251.466C23.5863 251.023 27.1053 249.332 29.8091 246.661L215.703 60.7674C218.374 58.0636 220.065 54.5446 220.508 50.7695C220.95 46.9945 220.118 43.1798 218.145 39.9315C216.171 36.6832 213.168 34.1876 209.614 32.8411C206.059 31.4947 202.157 31.3746 198.527 32.4999V32.4366ZM387.399 615.532C433.444 600.565 475.295 574.915 509.531 540.679C543.767 506.443 569.416 464.592 584.384 418.547C585.574 414.905 585.498 410.968 584.169 407.375C582.839 403.781 580.333 400.743 577.059 398.753C573.784 396.764 569.933 395.939 566.131 396.415C562.33 396.89 558.8 398.637 556.116 401.371L370.223 587.265C367.617 589.981 365.984 593.482 365.577 597.224C365.17 600.966 366.013 604.737 367.974 607.95C369.934 611.162 372.903 613.636 376.417 614.984C379.931 616.333 383.792 616.481 387.399 615.405V615.532ZM95.0272 523.441L102.442 499.8C104.337 493.868 104.559 487.529 103.083 481.479C101.607 475.429 98.4904 469.904 94.0765 465.512L29.8091 401.244C27.0928 398.563 23.5551 396.87 19.7627 396.438C15.9703 396.005 12.1424 396.858 8.8921 398.859C5.6418 400.861 3.15715 403.895 1.83594 407.476C0.514726 411.057 0.433345 414.978 1.60499 418.611C15.013 459.843 37.0269 497.757 66.1892 529.842C68.2115 532.051 70.7798 533.687 73.6357 534.588C76.4915 535.488 79.5341 535.621 82.4574 534.972C85.3806 534.323 88.0814 532.916 90.288 530.891C92.4946 528.867 94.1291 526.298 95.0272 523.441ZM490.898 124.845L483.483 148.422C481.59 154.364 481.369 160.713 482.845 166.772C484.32 172.831 487.436 178.367 491.849 182.774L556.116 246.978C558.833 249.659 562.37 251.352 566.163 251.784C569.955 252.217 573.783 251.364 577.033 249.363C580.284 247.361 582.768 244.327 584.089 240.746C585.411 237.165 585.492 233.244 584.32 229.612C570.895 188.405 548.883 150.516 519.736 118.443C517.714 116.235 515.146 114.598 512.29 113.698C509.434 112.797 506.391 112.665 503.468 113.314C500.545 113.963 497.844 115.37 495.637 117.394C493.431 119.418 491.796 121.988 490.898 124.845ZM311.026 550.377L519.039 342.048C521.434 339.689 523.336 336.877 524.635 333.776C525.933 330.675 526.602 327.346 526.602 323.984C526.602 320.622 525.933 317.294 524.635 314.193C523.336 311.092 521.434 308.28 519.039 305.921L311.026 97.9081C308.667 95.5127 305.855 93.6104 302.754 92.312C299.653 91.0135 296.324 90.3449 292.963 90.3449C289.601 90.3449 286.272 91.0135 283.171 92.312C280.07 93.6104 277.258 95.5127 274.899 97.9081L66.8864 305.921C64.4911 308.28 62.5889 311.092 61.2904 314.193C59.992 317.294 59.3231 320.622 59.3231 323.984C59.3231 327.346 59.992 330.675 61.2904 333.776C62.5889 336.877 64.4911 339.689 66.8864 342.048L274.899 550.06C277.258 552.456 280.07 554.358 283.171 555.657C286.272 556.955 289.601 557.624 292.963 557.624C296.324 557.624 299.653 556.955 302.754 555.657C305.855 554.358 308.667 552.456 311.026 550.06V550.377Z"
                    fill="#E0E0E0" />
            </svg>
        </div>
    </div>
</div>

<section class="product_dev product_dev_slogan">
    <h2>Сфокусируйтесь на главном. Автоматизируйте все остальное.</h2>
    <div class="dev_ring_1"></div>
    <div class="dev_ring_2"></div>
    <div class="dev_ring_3"></div>
    <div class="dev_ring_4"></div>
</section>

<div class="wrapper">
    <div class="content product_dev">
        <div class="arc_header">
            <div class="arc_1">
                <svg xmlns="http://www.w3.org/2000/svg" width="599" height="288" viewBox="0 0 599 288"
                    fill="none">
                    <path
                        d="M595.848 259.271C570.921 227.946 543.249 198.629 514.578 170.823C477.775 135.13 438.777 106.908 394.494 81.4544C329.535 44.116 262.515 9.34832 186.62 4.67714C144.942 2.11191 92.3619 5.21718 58.8029 34.006C35.158 54.2899 15.0615 88.6956 9.37407 119.689C-0.386297 172.879 4.82549 230.076 4.82549 284.146"
                        stroke="url(#paint0_linear_1508_9605)" stroke-width="6" stroke-linecap="round" />
                    <defs>
                        <linearGradient id="paint0_linear_1508_9605" x1="-31.4647" y1="187.853" x2="534.52"
                            y2="183.358" gradientUnits="userSpaceOnUse">
                            <stop offset="0" stop-color="#DF40FF" />
                            <stop offset="1" stop-color="white" />
                        </linearGradient>
                    </defs>
                </svg>
            </div>
            <div class="arc_2">
                <svg xmlns="http://www.w3.org/2000/svg" width="599" height="287" viewBox="0 0 599 287"
                    fill="none">
                    <path
                        d="M595.954 258.312C571.028 226.988 543.355 197.67 514.685 169.865C477.882 134.172 438.883 105.95 394.6 80.4959C329.642 43.1575 262.621 8.38983 186.727 3.71864C145.048 1.15342 92.4684 4.25869 58.9093 33.0475C35.2644 53.3314 15.1679 87.7371 9.48052 118.731C-0.279852 171.92 4.93194 229.117 4.93193 283.188"
                        stroke="url(#paint0_linear_1508_9606)" stroke-width="6" stroke-linecap="round" />
                    <defs>
                        <linearGradient id="paint0_linear_1508_9606" x1="-28.8293" y1="233.509" x2="636.29"
                            y2="232.01" gradientUnits="userSpaceOnUse">
                            <stop offset="0" stop-color="white" />
                            <stop offset="1" stop-color="#3377FF" />
                        </linearGradient>
                    </defs>
                </svg>
            </div>
        </div>
        <div class="six_steps">

            <div class="step">
                <div class="step_header">
                    <h6>Шаг 1</h6>
                    <h3>Анализ</h3>
                    <svg xmlns="http://www.w3.org/2000/svg" width="67" height="67" viewBox="0 0 67 67"
                        fill="none">
                        <g clip-path="url(#clip0_1704_4295)">
                            <path
                                d="M31.4629 66.2119L0.853125 35.5365C-0.263542 34.4198 -0.263542 32.5806 0.853125 31.4639L31.4629 0.854102C32.5796 -0.262565 34.4188 -0.262565 35.5355 0.854102L66.1453 31.4639C67.2619 32.5806 67.2619 34.4198 66.1453 35.5365L35.5355 66.1463C34.4188 67.3286 32.5796 67.3286 31.4629 66.2119Z"
                                fill="#DF40FF" />
                        </g>
                        <defs>
                            <clipPath id="clip0_1704_4295">
                                <rect width="67" height="67" fill="white" />
                            </clipPath>
                        </defs>
                    </svg>
                </div>
                <div class="step_footer">
                    <p>
                        Анализируем проект в деталях, изучаем проблемы конечных пользователей, которые они хотят
                        решить
                    </p>
                </div>
            </div>

            <div class="step">
                <div class="step_header">
                    <h6>Шаг 2</h6>
                    <h3>Прототип</h3>
                </div>
                <div class="step_footer">
                    <p>
                        Мы разрабатываем прототип проекта, где мы продумываем основные сценарии использования и
                        логику пользовательского интерфейса
                    </p>
                </div>
            </div>

            <div class="step">
                <div class="step_header">
                    <h6>Шаг 3</h6>
                    <h3>Дизайн</h3>
                    <svg xmlns="http://www.w3.org/2000/svg" width="68" height="67" viewBox="0 0 68 67"
                        fill="none">
                        <g clip-path="url(#clip0_1704_3929)">
                            <path
                                d="M33.832 66.9995C52.3336 66.9995 67.332 52.001 67.332 33.4995C67.332 14.998 52.3336 -0.000488281 33.832 -0.000488281C15.3305 -0.000488281 0.332031 14.998 0.332031 33.4995C0.332031 52.001 15.3305 66.9995 33.832 66.9995Z"
                                fill="#3377FF" />
                        </g>
                        <defs>
                            <clipPath id="clip0_1704_3929">
                                <rect width="67" height="67" fill="white" transform="translate(0.333008)" />
                            </clipPath>
                        </defs>
                    </svg>
                </div>
                <div class="step_footer">
                    <p>
                        Мы работаем над созданием интерфейса, который не только отражает имидж бренда, но и
                        обеспечивает удобство пользователей в его использовании
                    </p>
                </div>
            </div>

            <div class="step">
                <div class="step_header">
                    <h6>Шаг 4</h6>
                    <h3>Разработка</h3>
                    <svg xmlns="http://www.w3.org/2000/svg" width="67" height="67" viewBox="0 0 67 67"
                        fill="none">
                        <g clip-path="url(#clip0_1704_684)">
                            <path
                                d="M35.4962 2.62794L15.856 64.6358C15.4619 65.8181 16.3815 67.0662 17.6295 67.0662H28.4021C30.0442 67.0662 31.4893 66.0152 31.9491 64.4387L51.5893 2.43088C51.9178 1.24853 51.0638 0.000488281 49.8158 0.000488281H39.0432C37.4011 0.000488281 35.956 1.05147 35.4962 2.62794Z"
                                fill="#FF404E" />
                        </g>
                        <defs>
                            <clipPath id="clip0_1704_684">
                                <rect width="67" height="67" fill="white" />
                            </clipPath>
                        </defs>
                    </svg>
                </div>
                <div class="step_footer">
                    <p>
                        Как только дизайн завершен, мы передаем его для разработки. В итоге получаем
                        веб-продукт, который сочетает в себе привлекательность визуального исполнения и
                        функциональность
                    </p>
                </div>
            </div>

            <div class="step">
                <div class="step_header">
                    <h6>Шаг 5</h6>
                    <h3>Тестирование</h3>
                </div>
                <div class="step_footer">
                    <p>
                        Весь процесс разработки продукта включает тщательную проверку на каждом этапе, чтобы
                        убедиться, что его использование удобно пользователям
                    </p>
                </div>
            </div>

            <div class="step">
                <div class="step_header">
                    <h6>Шаг 6</h6>
                    <h3>Поддержка</h3>
                </div>
                <div class="step_footer">
                    <p>
                        Работа над продуктом продолжается после релиза, так как мы предоставляем услуги
                        поддержки для того, чтобы убедиться, что все функционирует правильно
                    </p>
                </div>
            </div>

        </div>
        <div class="arc_footer">
            <div class="arc_3">
                <svg xmlns="http://www.w3.org/2000/svg" width="599" height="287" viewBox="0 0 599 287"
                    fill="none">
                    <path
                        d="M3 28.6879C27.9262 60.0124 55.5987 89.3296 84.2693 117.135C121.072 152.828 160.071 181.05 204.354 206.504C269.313 243.843 336.333 278.61 412.228 283.281C453.906 285.847 506.486 282.741 540.045 253.952C563.69 233.669 583.786 199.263 589.474 168.269C599.234 115.08 594.022 57.8826 594.022 3.81206"
                        stroke="url(#paint0_linear_1508_9615)" stroke-width="6" stroke-linecap="round" />
                    <defs>
                        <linearGradient id="paint0_linear_1508_9615" x1="70.7764" y1="57.0851" x2="633.726"
                            y2="55.5868" gradientUnits="userSpaceOnUse">
                            <stop offset="0" stop-color="#FF404E" />
                            <stop offset="1" stop-color="white" />
                        </linearGradient>
                    </defs>
                </svg>
            </div>
            <div class="arc_4">
                <svg xmlns="http://www.w3.org/2000/svg" width="599" height="288" viewBox="0 0 599 288"
                    fill="none">
                    <path
                        d="M3.58789 28.7294C28.5141 60.0539 56.1866 89.3711 84.8572 117.177C121.66 152.87 160.659 181.092 204.942 206.546C269.9 243.884 336.921 278.652 412.815 283.323C454.494 285.888 507.074 282.783 540.633 253.994C564.278 233.71 584.374 199.304 590.061 168.311C599.822 115.121 594.61 57.9241 594.61 3.85357"
                        stroke="url(#paint0_linear_1508_9616)" stroke-width="6" stroke-linecap="round" />
                    <defs>
                        <linearGradient id="paint0_linear_1508_9616" x1="15.727" y1="3.85351" x2="653.534"
                            y2="3.85347" gradientUnits="userSpaceOnUse">
                            <stop offset="0" stop-color="#1E1E1E" />
                            <stop offset="1" stop-opacity="0" />
                        </linearGradient>
                    </defs>
                </svg>
            </div>
        </div>

        <div class="experience">
            <h5>Иновационные решения</h5>
            <p>
                Решения на основе инновационных технологий и ИИ, индивидуально адаптированные под Вас для
                увеличения эффективности бизнеса и прибыли компании
            </p>
            <h3>Наша экспертность в автоматизации</h3>
            <div class="expertise">
                <div class="type_expertise">
                    <div class="type_expertise_header">
                        <h5>Стратегия</h5>
                        <div class="type_expertise_description">


                            <div class="description_1">
                                <h6>DSS (Decision Support System)</h6>
                                <p>Математические модели и статистические методы</p>
                            </div>

                            <div class="description_2">
                                <h6>EIS (Executive Information System)</h6>
                                <p>Мониторинг ключевых показателей</p>
                            </div>

                            <div class="description_3">
                                <h6>FIM (Financial Information Management)</h6>
                                <p>Бюджетирование и финансовый учет</p>
                            </div>


                            <div class="description_4">
                                <h6>CRM (Customer Relationship Management)</h6>
                                <p>Маркетинг и продажи</p>
                            </div>




                        </div>
                    </div>
                    <div class="type_expertise_footer">
                        <ul>
                            <li class="expertise_active">
                                <p>DSS</p>
                            </li>
                            <li>
                                <p>EIS</p>
                            </li>
                            <li>
                                <p>FIM</p>
                            </li>
                            <li>
                                <p>CRM</p>
                            </li>
                        </ul>
                    </div>
                </div>

                <div class="type_expertise">
                    <div class="type_expertise_header">
                        <h5>Производство</h5>
                        <h6>SCM (Supply Chain Management)</h6>
                        <p>Поставки и логистика</p>
                    </div>
                    <div class="type_expertise_footer">
                        <ul>
                            <li class="expertise_active">
                                <p>SCM</p>
                            </li>
                            <li>
                                <p>WMS</p>
                            </li>
                            <li>
                                <p>ERP</p>
                            </li>
                            <li>
                                <p>MES</p>
                            </li>
                        </ul>
                    </div>
                </div>

                <div class="type_expertise">
                    <div class="type_expertise_header">
                        <h5>Персонал</h5>
                        <h6>HRM (Human Resource Management)</h6>
                        <p>Управление персоналом</p>
                    </div>
                    <div class="type_expertise_footer">
                        <ul>
                            <li class="expertise_active">
                                <p>HRM</p>
                            </li>
                            <li>
                                <p>LMS</p>
                            </li>
                            <li>
                                <p>PM</p>
                            </li>
                            <li>
                                <p>BPM</p>
                            </li>
                            <li>
                                <p>OAS</p>
                            </li>
                        </ul>
                    </div>
                </div>

                <div class="type_expertise">
                    <div class="type_expertise_header">
                        <h5>Информация</h5>
                        <h6>ECM (Enterprise Content Management)</h6>
                        <p>Прием и обработка документов</p>
                    </div>
                    <div class="type_expertise_footer">
                        <ul>
                            <li class="expertise_active">
                                <p>ECM</p>
                            </li>
                            <li>
                                <p>EDI</p>
                            </li>
                        </ul>
                    </div>
                </div>

            </div>
        </div>

        <section class="word_case">
            <h2>От слов к делу</h2>
            <h3>Кейсы</h3>
            <div class="cases">
                <div class="case">
                    <div class="left_case">
                        <div class="left_case_header">
                            <h4>Система автоматизации для Premium Pipe</h4>
                            <ul>
                                <li>
                                    <p>Производство</p>
                                </li>
                                <li>
                                    <p>Логистика и доставка</p>
                                </li>
                                <li>
                                    <p>Управление складом</p>
                                </li>
                            </ul>
                            <h6>Автоматизированная система учета данных и генерации документов для производства
                                металических изделий</h6>
                            <p class="case_description">Описание того что на изображении</p>
                        </div>
                        <div class="left_case_footer">

                            <a href="#">
                                <span>
                                    Подробнее
                                    <svg xmlns="http://www.w3.org/2000/svg" width="32" height="32"
                                        viewBox="0 0 32 32" fill="none">
                                        <path
                                            d="M23.3027 8L8 23.3027M23.3027 8L23.3027 21.3456M23.3027 8L9.98161 8"
                                            stroke="#1E1E1E" stroke-width="1.5" stroke-linejoin="round" />
                                    </svg>
                                </span>
                            </a>

                        </div>
                    </div>
                    <div class="right_case">
                        <img src="@/assets/img/development_case.webp" alt="case">
                    </div>
                </div>

                <div class="case">
                    <div class="left_case">
                        <div class="left_case_header">
                            <h4>Kucher Desk</h4>
                            <ul>
                                <li>
                                    <p>Сервис</p>
                                </li>
                            </ul>
                            <h6>Коллаборативная платформа для генерации идей и проведения мозговых штурмов с
                                командами</h6>
                            <p class="case_description">Описание того что на изображении</p>
                        </div>
                        <div class="left_case_footer">

                            <a href="#">
                                <span>
                                    Подробнее
                                    <svg xmlns="http://www.w3.org/2000/svg" width="32" height="32"
                                        viewBox="0 0 32 32" fill="none">
                                        <path
                                            d="M23.3027 8L8 23.3027M23.3027 8L23.3027 21.3456M23.3027 8L9.98161 8"
                                            stroke="#1E1E1E" stroke-width="1.5" stroke-linejoin="round" />
                                    </svg>
                                </span>
                            </a>

                        </div>
                    </div>
                    <div class="right_case">
                        <img src="@/assets/img/development_case.webp" alt="case">
                    </div>
                </div>
            </div>
        </section>

    </div>
</div>

</main>

    <TheFooter />
</template>