<script setup>
import { ref } from "vue";
import TheHeader from "@/components/TheHeader.vue";
import TheFooter from "@/components/TheFooter.vue";
import IconPrimaryBtn from "@/components/icons/IconPrimaryBtn.vue";
import { RouterLink } from "vue-router";
import IconCard from "@/components/icons/IconCard.vue";
//swiper
import { Swiper, SwiperSlide } from "swiper/vue";
import { Navigation, Pagination } from "swiper/modules";
//подключение стилей swiper(must)
import "swiper/css";
import "swiper/css/navigation";
import "swiper/css/pagination";
//модуль swiper(must)
const modules = [Navigation, Pagination];
//кнопки navigation
const prev = ref(null);
const next = ref(null);
</script>

<style scoped>
/* добавил для корректной работы swiper */
.swiper {
  height: 26.0416667vw;
}

@media (max-width: 990px) {
  .swiper-slide {
    height: 250px;
  }
}

@media (max-width: 600px) {
  .swiper-slide {
    height: 150px;
  }
}

.services__slide {
  display: -webkit-box;
  display: -ms-flexbox;
  display: flex;
  -webkit-box-orient: vertical;
  -webkit-box-direction: normal;
  -ms-flex-direction: column;
  flex-direction: column;
  -webkit-box-pack: justify;
  -ms-flex-pack: justify;
  justify-content: space-between;
}

.primary-btn {
  font-size: 16px;
  color: #1e1e1e;
  text-decoration: none;
}

@media (max-width: 1440px) {
  .primary-btn {
    font-size: 14px;
  }
}

@media (max-width: 990px) {
  .primary-btn {
    font-size: 12px;
  }
}

.indicates {
  width: 16.40625vw;
}
</style>

<template>
  <TheHeader />

  <main>
    <section class="intro">
      <div class="wrapper">
        <h1>
          <!-- <span data-text="{Строим}">{Строим}</span> будущее ИТ-развития вместе -->
          <span>{Разработка}</span> ИТ-решений для бизнеса
        </h1>

        <h4>
          Создаем технологические решения, нацеленные на ваш успех. Доверьте нам
          свои идеи, и мы сделаем их работающей частью вашего бизнеса.
        </h4>
      </div>
    </section>

    <section class="services">
      <div class="wrapper">
        <h4>Мы занимаемся</h4>

        <div class="services__container">
          <div class="services__pre">
            <RouterLink to="/services" class="services__btn primary-btn"
              >Все услуги
              <IconPrimaryBtn />
            </RouterLink>
            <p class="services__text">
              Наш подход основан на детальном анализе, полном погружении в вашу
              компанию и инструментах, которые помогут решить ваши задачи и
              привлечь клиентов
            </p>
          </div>
          <div class="services__slider-container swiper-container">
            <swiper
              :navigation="{
                prevEl: prev,
                nextEl: next,
              }"
              :pagination="{
                clickable: true,
                el: '.indicates',
                bulletClass: 'ind ind-2',
                bulletActiveClass: '.ind ind-1 ind-active',
              }"
              :slidesPerGroup="3"
              :slides-per-view="3"
              :space-between="16"
              :modules="modules"
            >
              <swiper-slide>
                <div class="services__slide swiper-slide slide-1">
                  <div class="bg_img_slide">
                    <svg
                      xmlns="http://www.w3.org/2000/svg"
                      width="250"
                      height="250"
                      viewBox="0 0 250 250"
                      fill="none"
                    >
                      <path
                        d="M316.444 165.698L203.26 278.882C201.948 280.178 200.242 280.999 198.411 281.215C196.581 281.431 194.73 281.03 193.152 280.076C191.575 279.122 190.361 277.668 189.703 275.946C189.045 274.224 188.981 272.332 189.52 270.569L245.327 94.1423C245.753 92.7886 246.52 91.5676 247.555 90.5971C248.59 89.6265 249.858 88.9393 251.236 88.6019C252.615 88.2645 254.056 88.2882 255.423 88.6707C256.789 89.0532 258.034 89.7817 259.036 90.7857L316.444 148.193C318.724 150.536 320 153.676 320 156.946C320 160.215 318.724 163.355 316.444 165.698ZM116.741 34.9779L3.55659 148.193C1.27624 150.536 0.000244141 153.676 0.000244141 156.946C0.000244141 160.215 1.27624 163.355 3.55659 165.698L60.9643 223.106C61.9669 224.11 63.2115 224.838 64.5779 225.221C65.9442 225.603 67.3861 225.627 68.7643 225.289C70.1424 224.952 71.4103 224.265 72.4454 223.294C73.4804 222.324 74.2477 221.103 74.6731 219.749L130.481 43.3224C131.032 41.557 130.976 39.6581 130.322 37.9282C129.668 36.1983 128.455 34.7369 126.874 33.777C125.293 32.8171 123.437 32.4138 121.6 32.6315C119.764 32.8491 118.053 33.6751 116.741 34.9779ZM209.848 0H191.026C187.524 0.0113814 184.118 1.13605 181.298 3.21132C178.478 5.28659 176.392 8.20493 175.34 11.5443L88.6956 284.968C87.787 287.852 87.6868 290.93 88.4058 293.867C89.1249 296.804 90.6356 299.487 92.7737 301.625L101.401 310.252C102.55 311.401 103.915 312.31 105.417 312.93C106.919 313.549 108.528 313.865 110.153 313.86H128.975C132.473 313.855 135.879 312.737 138.699 310.667C141.52 308.597 143.607 305.683 144.66 302.347L231.148 28.9234C232.059 26.0347 232.161 22.9513 231.442 20.0089C230.723 17.0664 229.211 14.3774 227.07 12.2344L218.569 3.63897C216.258 1.31874 213.122 0.00997792 209.848 0Z"
                        fill="white"
                        fill-opacity="0.4"
                      />
                    </svg>
                  </div>
                  <div class="services__top-block">
                    <h5>Разработка приложений</h5>
                    <div class="services__top_box">
                      <!-- <svg width="45" height="45" viewBox="0 0 45 45" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M33 13L13 33M33 13L33 30.4422M33 13L15.5899 13" stroke="#3C3C3C" stroke-width="2.5"
                          stroke-linejoin="round" />
                      </svg> -->
                      <IconCard />
                    </div>
                  </div>
                  <p>
                    IT-решения для оптимизации работы компании, улучшения
                    производительности и сокращения затрат
                  </p>
                </div>
              </swiper-slide>
              <swiper-slide>
                <div class="services__slide swiper-slide slide-2">
                  <div class="services__top-block">
                    <h5>Создание MVP</h5>
                    <div class="services__top_box">
                      <!-- <svg width="45" height="45" viewBox="0 0 45 45" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M33 13L13 33M33 13L33 30.4422M33 13L15.5899 13" stroke="#3C3C3C" stroke-width="2.5"
                          stroke-linejoin="round" />
                      </svg> -->
                      <IconCard />
                    </div>
                  </div>
                  <p>
                    Быстро и эффективно выведем ваш проект на рынок с
                    минимальными затратами и максимальной отдачей
                  </p>
                </div>
              </swiper-slide>
              <swiper-slide>
                <div class="services__slide swiper-slide slide-3">
                  <div class="bg_img_slide">
                    <svg
                      xmlns="http://www.w3.org/2000/svg"
                      width="250"
                      height="250"
                      viewBox="0 0 250 250"
                      fill="none"
                    >
                      <path
                        d="M55.69 219.852L3.53485 167.697C-1.17796 162.984 -1.17796 155.13 3.53485 150.103L148.375 4.94796C154.973 -1.64997 165.341 -1.64997 171.625 4.94796L316.466 149.788C321.178 154.501 321.178 162.356 316.466 167.383L264.625 219.852C260.854 223.622 254.257 222.994 251.743 218.281L170.683 78.1536C165.97 69.9848 154.031 69.9848 149.318 78.1536L68.5717 217.967C65.744 222.68 59.4602 223.622 55.69 219.852ZM79.2541 290.23L91.8215 302.798C94.9634 305.94 99.0479 307.51 103.446 307.51H216.554C220.953 307.51 225.037 305.625 228.179 302.798L240.746 290.23C246.088 284.889 247.03 276.72 243.26 270.122L167.227 138.163C164.085 132.508 156.23 132.508 152.774 138.163L76.7405 270.436C72.9703 276.72 73.9129 284.889 79.2541 290.23Z"
                        fill="white"
                        fill-opacity="0.4"
                      />
                    </svg>
                  </div>
                  <div class="services__top-block">
                    <h5>Внедрение ИИ</h5>
                    <div class="services__top_box">
                      <!-- <svg width="45" height="45" viewBox="0 0 45 45" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M33 13L13 33M33 13L33 30.4422M33 13L15.5899 13" stroke="#3C3C3C" stroke-width="2.5"
                          stroke-linejoin="round" />
                      </svg> -->
                      <IconCard />
                    </div>
                  </div>
                  <p>
                    Повышение эффективности через автоматизацию задач, анализ
                    данных, персонализацию услуг — лишь малая часть его полезных
                    возможностей
                  </p>
                </div>
              </swiper-slide>
              <swiper-slide>
                <div class="services__slide swiper-slide slide-4">
                  <div class="bg_img_slide">
                    <svg
                      xmlns="http://www.w3.org/2000/svg"
                      width="250"
                      height="250"
                      viewBox="0 0 250 250"
                      fill="none"
                    >
                      <path
                        d="M162.258 4.48206C162.646 3.17551 163.45 2.03115 164.547 1.2224C165.644 0.413645 166.975 -0.0154438 168.338 0.000167224H214.975C216.296 0.00933519 217.596 0.327622 218.772 0.929525C219.948 1.53143 220.966 2.40024 221.746 3.46643C222.526 4.53261 223.046 5.76653 223.263 7.06947C223.48 8.3724 223.39 9.70815 222.998 10.9698L212.969 42.6563C212.53 44.0326 211.745 45.2731 210.689 46.2588C209.633 47.2444 208.341 47.9422 206.938 48.2852C205.535 48.6281 204.067 48.6048 202.675 48.2173C201.283 47.8298 200.015 47.0913 198.991 46.0725L163.825 10.9384C162.985 10.1172 162.393 9.07648 162.116 7.93493C161.839 6.79338 161.888 5.59696 162.258 4.48206ZM76.0056 277.155L65.9762 309.061C65.5838 310.321 65.4925 311.655 65.7098 312.957C65.9272 314.258 66.4471 315.491 67.2276 316.555C68.0081 317.619 69.0274 318.485 70.2036 319.083C71.3799 319.681 72.6801 319.995 73.9997 319.999H120.636C121.995 320.017 123.323 319.592 124.42 318.79C125.516 317.987 126.322 316.849 126.716 315.549C127.087 314.434 127.136 313.237 126.859 312.096C126.582 310.954 125.989 309.914 125.149 309.092L89.984 273.927C88.9745 272.897 87.717 272.145 86.3324 271.742C84.9478 271.339 83.4828 271.299 82.0784 271.627C80.6741 271.954 79.3777 272.638 78.3141 273.612C77.2504 274.585 76.4555 275.816 76.0056 277.186V277.155ZM97.788 15.7651C75.015 23.1696 54.3174 35.8583 37.3873 52.7938C20.4572 69.7294 7.77521 90.431 0.378001 113.206C-0.178496 115.002 -0.119105 116.932 0.546723 118.689C1.21255 120.447 2.44657 121.932 4.05287 122.908C5.65917 123.884 7.54557 124.295 9.41237 124.076C11.2792 123.857 13.0193 123.021 14.3564 121.7L106.282 29.7748C107.603 28.4378 108.439 26.6976 108.658 24.8308C108.877 22.964 108.465 21.0776 107.489 19.4713C106.513 17.865 105.029 16.6309 103.271 15.9651C101.513 15.2993 99.5834 15.2399 97.788 15.7964V15.7651ZM191.186 304.109C213.956 296.708 234.652 284.024 251.581 267.094C268.511 250.164 281.195 229.469 288.597 206.699C289.185 204.898 289.148 202.951 288.49 201.174C287.833 199.397 286.594 197.895 284.974 196.911C283.355 195.927 281.451 195.519 279.571 195.754C277.691 195.989 275.945 196.853 274.618 198.205L182.693 290.131C181.404 291.474 180.597 293.205 180.395 295.056C180.194 296.906 180.611 298.771 181.581 300.359C182.55 301.948 184.018 303.171 185.756 303.838C187.493 304.505 189.403 304.578 191.186 304.046V304.109ZM46.6071 258.569L50.274 246.879C51.211 243.946 51.3206 240.811 50.5907 237.819C49.8607 234.827 48.3197 232.095 46.1369 229.923L14.3564 198.143C13.0132 196.816 11.2638 195.98 9.38836 195.766C7.51298 195.552 5.62008 195.974 4.01279 196.963C2.4055 197.953 1.17683 199.453 0.52348 201.224C-0.129866 202.995 -0.170109 204.934 0.409277 206.73C7.03962 227.12 17.9256 245.869 32.3465 261.735C33.3466 262.827 34.6166 263.636 36.0288 264.082C37.441 264.527 38.9457 264.592 40.3912 264.272C41.8368 263.951 43.1723 263.255 44.2635 262.254C45.3547 261.253 46.163 259.982 46.6071 258.569ZM242.367 61.4613L238.701 73.1204C237.764 76.0589 237.655 79.1983 238.385 82.1946C239.115 85.191 240.655 87.9287 242.838 90.1076L274.618 121.857C275.961 123.183 277.711 124.02 279.586 124.234C281.462 124.448 283.354 124.026 284.962 123.036C286.569 122.047 287.798 120.546 288.451 118.775C289.104 117.005 289.145 115.066 288.565 113.269C281.926 92.8925 271.041 74.1558 256.628 58.2958C255.628 57.2038 254.358 56.3944 252.946 55.9491C251.533 55.5038 250.029 55.4383 248.583 55.7592C247.138 56.0801 245.802 56.776 244.711 57.777C243.62 58.778 242.812 60.0487 242.367 61.4613ZM153.42 271.89L256.283 168.869C257.468 167.703 258.408 166.312 259.05 164.779C259.693 163.245 260.023 161.6 260.023 159.937C260.023 158.275 259.693 156.629 259.05 155.095C258.408 153.562 257.468 152.171 256.283 151.005L153.42 48.1411C152.253 46.9565 150.863 46.0158 149.329 45.3738C147.796 44.7317 146.15 44.401 144.487 44.401C142.825 44.401 141.179 44.7317 139.645 45.3738C138.112 46.0158 136.721 46.9565 135.555 48.1411L32.6913 151.005C31.5068 152.171 30.5661 153.562 29.924 155.095C29.282 156.629 28.9512 158.275 28.9512 159.937C28.9512 161.6 29.282 163.245 29.924 164.779C30.5661 166.312 31.5068 167.703 32.6913 168.869L135.555 271.733C136.721 272.917 138.112 273.858 139.645 274.5C141.179 275.142 142.825 275.473 144.487 275.473C146.15 275.473 147.796 275.142 149.329 274.5C150.863 273.858 152.253 272.917 153.42 271.733V271.89Z"
                        fill="white"
                        fill-opacity="0.4"
                      />
                    </svg>
                  </div>
                  <div class="services__top-block">
                    <h5>Доработка IT-продукта</h5>
                    <div class="services__top_box">
                      <!-- <svg width="45" height="45" viewBox="0 0 45 45" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M33 13L13 33M33 13L33 30.4422M33 13L15.5899 13" stroke="#3C3C3C" stroke-width="2.5"
                          stroke-linejoin="round" />
                      </svg> -->
                      <IconCard />
                    </div>
                  </div>
                  <p>
                    Экспертное обновление продукта для улучшения
                    функциональности, производительности и удовлетворения
                    потребностей клиентов
                  </p>
                </div>
              </swiper-slide>
              <!-- <swiper-slide>
                <div class="services__slide swiper-slide slide-5">
                  <div class="services__top-block">
                    <h5>Разработка документации</h5>
                    <svg width="45" height="45" viewBox="0 0 45 45" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path d="M33 13L13 33M33 13L33 30.4422M33 13L15.5899 13" stroke="#3C3C3C" stroke-width="2.5"
                        stroke-linejoin="round" />
                    </svg>
                  </div>
                  <p>
                    Разработаем технические задания, требования к продукту,
                    схемы, архитектурные диаграммы и другие необходимые
                    материалы для успешной разработки.
                  </p>
                </div>
              </swiper-slide>
              <swiper-slide>
                <div class="services__slide swiper-slide slide-6">
                  <div class="services__top-block">
                    <h5>Разработка продукта</h5>
                    <svg width="45" height="45" viewBox="0 0 45 45" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path d="M33 13L13 33M33 13L33 30.4422M33 13L15.5899 13" stroke="#3C3C3C" stroke-width="2.5"
                        stroke-linejoin="round" />
                    </svg>
                  </div>
                  <p>
                    Создадим сайт с уникальным дизайном, оптимизируем его для
                    продвижения и увеличим Ваши продажи.
                  </p>
                </div>
              </swiper-slide> -->
            </swiper>
            <div class="services__nav">
              <div class="indicates">
                <span class="ind ind-1 ind-active"></span>
                <span class="ind ind-2"></span>
              </div>
              <div class="btns">
                <div ref="prev" class="btn-prev">
                  <svg
                    width="32"
                    height="19"
                    viewBox="0 0 32 19"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M0.358715 9.65125H32M0.358715 9.65125L5.06843 4.94153L7.42329 2.58667L8.60072 1.4093M0.358715 9.65125L5.0771 14.3696L7.43629 16.7288L8.61588 17.9085"
                      stroke="#3C3C3C"
                      stroke-width="2"
                      stroke-linejoin="round"
                    />
                  </svg>
                </div>
                <div ref="next" class="btn-next">
                  <svg
                    width="33"
                    height="19"
                    viewBox="0 0 33 19"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M31.6413 9.65125H0M31.6413 9.65125L26.9316 4.94153L24.5767 2.58667L23.3993 1.4093M31.6413 9.65125L26.9229 14.3696L24.5637 16.7288L23.3841 17.9085"
                      stroke="#3C3C3C"
                      stroke-width="2"
                      stroke-linejoin="round"
                    />
                  </svg>
                </div>
              </div>
            </div>
          </div>

          <div class="services__mobile">
            <div class="services__slide swiper-slide slide-1">
              <div class="bg_img_slide">
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  width="250"
                  height="250"
                  viewBox="0 0 250 250"
                  fill="none"
                >
                  <path
                    d="M316.444 165.698L203.26 278.882C201.948 280.178 200.242 280.999 198.411 281.215C196.581 281.431 194.73 281.03 193.152 280.076C191.575 279.122 190.361 277.668 189.703 275.946C189.045 274.224 188.981 272.332 189.52 270.569L245.327 94.1423C245.753 92.7886 246.52 91.5676 247.555 90.5971C248.59 89.6265 249.858 88.9393 251.236 88.6019C252.615 88.2645 254.056 88.2882 255.423 88.6707C256.789 89.0532 258.034 89.7817 259.036 90.7857L316.444 148.193C318.724 150.536 320 153.676 320 156.946C320 160.215 318.724 163.355 316.444 165.698ZM116.741 34.9779L3.55659 148.193C1.27624 150.536 0.000244141 153.676 0.000244141 156.946C0.000244141 160.215 1.27624 163.355 3.55659 165.698L60.9643 223.106C61.9669 224.11 63.2115 224.838 64.5779 225.221C65.9442 225.603 67.3861 225.627 68.7643 225.289C70.1424 224.952 71.4103 224.265 72.4454 223.294C73.4804 222.324 74.2477 221.103 74.6731 219.749L130.481 43.3224C131.032 41.557 130.976 39.6581 130.322 37.9282C129.668 36.1983 128.455 34.7369 126.874 33.777C125.293 32.8171 123.437 32.4138 121.6 32.6315C119.764 32.8491 118.053 33.6751 116.741 34.9779ZM209.848 0H191.026C187.524 0.0113814 184.118 1.13605 181.298 3.21132C178.478 5.28659 176.392 8.20493 175.34 11.5443L88.6956 284.968C87.787 287.852 87.6868 290.93 88.4058 293.867C89.1249 296.804 90.6356 299.487 92.7737 301.625L101.401 310.252C102.55 311.401 103.915 312.31 105.417 312.93C106.919 313.549 108.528 313.865 110.153 313.86H128.975C132.473 313.855 135.879 312.737 138.699 310.667C141.52 308.597 143.607 305.683 144.66 302.347L231.148 28.9234C232.059 26.0347 232.161 22.9513 231.442 20.0089C230.723 17.0664 229.211 14.3774 227.07 12.2344L218.569 3.63897C216.258 1.31874 213.122 0.00997792 209.848 0Z"
                    fill="white"
                    fill-opacity="0.4"
                  />
                </svg>
              </div>
              <div class="services__top-block">
                <h5>Разработка приложений</h5>
                <!-- <svg width="45" height="45" viewBox="0 0 45 45" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M33 13L13 33M33 13L33 30.4422M33 13L15.5899 13" stroke="#3C3C3C" stroke-width="2.5"
                    stroke-linejoin="round" />
                </svg> -->
                <IconCard />
              </div>
              <p>
                IT-решения для оптимизации работы компании, улучшения
                производительности и сокращения затрат
              </p>
            </div>

            <div class="services__slide swiper-slide slide-2">
              <div class="services__top-block">
                <h5>Создание MVP</h5>
                <!-- <svg width="45" height="45" viewBox="0 0 45 45" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M33 13L13 33M33 13L33 30.4422M33 13L15.5899 13" stroke="#3C3C3C" stroke-width="2.5"
                    stroke-linejoin="round" />
                </svg> -->
                <IconCard />
              </div>
              <p>
                Быстро и эффективно выведем ваш проект на рынок с минимальными
                затратами и максимальной отдачей
              </p>
            </div>

            <div class="services__slide swiper-slide slide-3">
              <div class="bg_img_slide">
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  width="250"
                  height="250"
                  viewBox="0 0 250 250"
                  fill="none"
                >
                  <path
                    d="M55.69 219.852L3.53485 167.697C-1.17796 162.984 -1.17796 155.13 3.53485 150.103L148.375 4.94796C154.973 -1.64997 165.341 -1.64997 171.625 4.94796L316.466 149.788C321.178 154.501 321.178 162.356 316.466 167.383L264.625 219.852C260.854 223.622 254.257 222.994 251.743 218.281L170.683 78.1536C165.97 69.9848 154.031 69.9848 149.318 78.1536L68.5717 217.967C65.744 222.68 59.4602 223.622 55.69 219.852ZM79.2541 290.23L91.8215 302.798C94.9634 305.94 99.0479 307.51 103.446 307.51H216.554C220.953 307.51 225.037 305.625 228.179 302.798L240.746 290.23C246.088 284.889 247.03 276.72 243.26 270.122L167.227 138.163C164.085 132.508 156.23 132.508 152.774 138.163L76.7405 270.436C72.9703 276.72 73.9129 284.889 79.2541 290.23Z"
                    fill="white"
                    fill-opacity="0.4"
                  />
                </svg>
              </div>
              <div class="services__top-block">
                <h5>Внедрение ИИ</h5>
                <!-- <svg width="45" height="45" viewBox="0 0 45 45" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M33 13L13 33M33 13L33 30.4422M33 13L15.5899 13" stroke="#3C3C3C" stroke-width="2.5"
                    stroke-linejoin="round" />
                </svg> -->
                <IconCard />
              </div>
              <p>
                Повышение эффективности через автоматизацию задач, анализ
                данных, персонализацию услуг — лишь малая часть его полезных
                возможностей
              </p>
            </div>

            <div class="services__slide swiper-slide slide-4">
              <div class="bg_img_slide">
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  width="250"
                  height="250"
                  viewBox="0 0 250 250"
                  fill="none"
                >
                  <path
                    d="M162.258 4.48206C162.646 3.17551 163.45 2.03115 164.547 1.2224C165.644 0.413645 166.975 -0.0154438 168.338 0.000167224H214.975C216.296 0.00933519 217.596 0.327622 218.772 0.929525C219.948 1.53143 220.966 2.40024 221.746 3.46643C222.526 4.53261 223.046 5.76653 223.263 7.06947C223.48 8.3724 223.39 9.70815 222.998 10.9698L212.969 42.6563C212.53 44.0326 211.745 45.2731 210.689 46.2588C209.633 47.2444 208.341 47.9422 206.938 48.2852C205.535 48.6281 204.067 48.6048 202.675 48.2173C201.283 47.8298 200.015 47.0913 198.991 46.0725L163.825 10.9384C162.985 10.1172 162.393 9.07648 162.116 7.93493C161.839 6.79338 161.888 5.59696 162.258 4.48206ZM76.0056 277.155L65.9762 309.061C65.5838 310.321 65.4925 311.655 65.7098 312.957C65.9272 314.258 66.4471 315.491 67.2276 316.555C68.0081 317.619 69.0274 318.485 70.2036 319.083C71.3799 319.681 72.6801 319.995 73.9997 319.999H120.636C121.995 320.017 123.323 319.592 124.42 318.79C125.516 317.987 126.322 316.849 126.716 315.549C127.087 314.434 127.136 313.237 126.859 312.096C126.582 310.954 125.989 309.914 125.149 309.092L89.984 273.927C88.9745 272.897 87.717 272.145 86.3324 271.742C84.9478 271.339 83.4828 271.299 82.0784 271.627C80.6741 271.954 79.3777 272.638 78.3141 273.612C77.2504 274.585 76.4555 275.816 76.0056 277.186V277.155ZM97.788 15.7651C75.015 23.1696 54.3174 35.8583 37.3873 52.7938C20.4572 69.7294 7.77521 90.431 0.378001 113.206C-0.178496 115.002 -0.119105 116.932 0.546723 118.689C1.21255 120.447 2.44657 121.932 4.05287 122.908C5.65917 123.884 7.54557 124.295 9.41237 124.076C11.2792 123.857 13.0193 123.021 14.3564 121.7L106.282 29.7748C107.603 28.4378 108.439 26.6976 108.658 24.8308C108.877 22.964 108.465 21.0776 107.489 19.4713C106.513 17.865 105.029 16.6309 103.271 15.9651C101.513 15.2993 99.5834 15.2399 97.788 15.7964V15.7651ZM191.186 304.109C213.956 296.708 234.652 284.024 251.581 267.094C268.511 250.164 281.195 229.469 288.597 206.699C289.185 204.898 289.148 202.951 288.49 201.174C287.833 199.397 286.594 197.895 284.974 196.911C283.355 195.927 281.451 195.519 279.571 195.754C277.691 195.989 275.945 196.853 274.618 198.205L182.693 290.131C181.404 291.474 180.597 293.205 180.395 295.056C180.194 296.906 180.611 298.771 181.581 300.359C182.55 301.948 184.018 303.171 185.756 303.838C187.493 304.505 189.403 304.578 191.186 304.046V304.109ZM46.6071 258.569L50.274 246.879C51.211 243.946 51.3206 240.811 50.5907 237.819C49.8607 234.827 48.3197 232.095 46.1369 229.923L14.3564 198.143C13.0132 196.816 11.2638 195.98 9.38836 195.766C7.51298 195.552 5.62008 195.974 4.01279 196.963C2.4055 197.953 1.17683 199.453 0.52348 201.224C-0.129866 202.995 -0.170109 204.934 0.409277 206.73C7.03962 227.12 17.9256 245.869 32.3465 261.735C33.3466 262.827 34.6166 263.636 36.0288 264.082C37.441 264.527 38.9457 264.592 40.3912 264.272C41.8368 263.951 43.1723 263.255 44.2635 262.254C45.3547 261.253 46.163 259.982 46.6071 258.569ZM242.367 61.4613L238.701 73.1204C237.764 76.0589 237.655 79.1983 238.385 82.1946C239.115 85.191 240.655 87.9287 242.838 90.1076L274.618 121.857C275.961 123.183 277.711 124.02 279.586 124.234C281.462 124.448 283.354 124.026 284.962 123.036C286.569 122.047 287.798 120.546 288.451 118.775C289.104 117.005 289.145 115.066 288.565 113.269C281.926 92.8925 271.041 74.1558 256.628 58.2958C255.628 57.2038 254.358 56.3944 252.946 55.9491C251.533 55.5038 250.029 55.4383 248.583 55.7592C247.138 56.0801 245.802 56.776 244.711 57.777C243.62 58.778 242.812 60.0487 242.367 61.4613ZM153.42 271.89L256.283 168.869C257.468 167.703 258.408 166.312 259.05 164.779C259.693 163.245 260.023 161.6 260.023 159.937C260.023 158.275 259.693 156.629 259.05 155.095C258.408 153.562 257.468 152.171 256.283 151.005L153.42 48.1411C152.253 46.9565 150.863 46.0158 149.329 45.3738C147.796 44.7317 146.15 44.401 144.487 44.401C142.825 44.401 141.179 44.7317 139.645 45.3738C138.112 46.0158 136.721 46.9565 135.555 48.1411L32.6913 151.005C31.5068 152.171 30.5661 153.562 29.924 155.095C29.282 156.629 28.9512 158.275 28.9512 159.937C28.9512 161.6 29.282 163.245 29.924 164.779C30.5661 166.312 31.5068 167.703 32.6913 168.869L135.555 271.733C136.721 272.917 138.112 273.858 139.645 274.5C141.179 275.142 142.825 275.473 144.487 275.473C146.15 275.473 147.796 275.142 149.329 274.5C150.863 273.858 152.253 272.917 153.42 271.733V271.89Z"
                    fill="white"
                    fill-opacity="0.4"
                  />
                </svg>
              </div>
              <div class="services__top-block">
                <h5>Доработка IT-продукта</h5>
                <!-- <svg width="45" height="45" viewBox="0 0 45 45" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M33 13L13 33M33 13L33 30.4422M33 13L15.5899 13" stroke="#3C3C3C" stroke-width="2.5"
                    stroke-linejoin="round" />
                </svg> -->
                <IconCard />
              </div>
              <p>
                Экспертное обновление продукта для улучшения функциональности,
                производительности и удовлетворения потребностей клиентов
              </p>
            </div>

            <!-- <div class="services__slide swiper-slide slide-2">
              <div class="services__top-block">
                <h5>Заказная разработка</h5>
                <svg width="45" height="45" viewBox="0 0 45 45" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M33 13L13 33M33 13L33 30.4422M33 13L15.5899 13" stroke="#3C3C3C" stroke-width="2.5"
                    stroke-linejoin="round" />
                </svg>
              </div>
              <p>
                Автоматизируем бизнес - процессы и создадим программный продукт
                под потребности вашего бизнеса. Возьмем на себя полный цикл
                разработки.
              </p>
            </div>

            <div class="services__slide swiper-slide slide-6">
              <div class="services__top-block">
                <h5>Разработка продукта</h5>
                <svg width="45" height="45" viewBox="0 0 45 45" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M33 13L13 33M33 13L33 30.4422M33 13L15.5899 13" stroke="#3C3C3C" stroke-width="2.5"
                    stroke-linejoin="round" />
                </svg>
              </div>
              <p>
                Создадим сайт с уникальным дизайном, оптимизируем его для
                продвижения и увеличим Ваши продажи.
              </p>
            </div> -->
          </div>
        </div>
      </div>
    </section>

    <section class="benefits">
      <div class="wrapper">
        <h2>
          <span>Нас выбирают</span>
          потому что
        </h2>
        <span class="divider"></span>
        <h4>Создаем индивидуальные решения</h4>
        <h4>Ведем полную документацию</h4>
        <h4>Понимаем ваши цели</h4>
      </div>
    </section>

    <section class="about">
      <div class="wrapper">
        <h4>Немного о нас</h4>
        <div class="about__container">
          <div class="about__pre">
            <!-- <button class="about__btn primary-btn">
              О компании
              <IconPrimaryBtn />
            </button> -->
            <div>
              <p class="about__text">
                Наш продукт, зарегистрирован в реестре Российского ПО
              </p>
              <p class="about__text">
                Имеем аккредитацию в Министерстве цифрового развития, связи и
                массовых коммуникаций
              </p>
            </div>
          </div>
          <div class="about__blocks">
            <div class="about__block">
              <span class="about__block-num">5+</span>
              <p>Лет опыта</p>
            </div>
            <div class="about__divider"></div>
            <div class="about__block">
              <span class="about__block-num">20+</span>
              <p>Профессионалов</p>
            </div>
            <div class="about__divider"></div>
            <div class="about__block">
              <span class="about__block-num">50+</span>
              <p>Выполенных проектов</p>
            </div>
          </div>
        </div>
      </div>
    </section>
  </main>

  <TheFooter />
</template>
