<script setup>
import TheHeader from "@/components/TheHeader.vue";
import TheFooter from "@/components/TheFooter.vue";
import TheSpotsFore from '@/components/TheSpotsFore.vue';
import PageTitle from '@/components/PageTitle.vue';
import PageSteps from '@/components/PageSteps.vue';
</script>

<script>
export default {
    components: {
        PageSteps,
    },
    data() {
        return {
            pageData: {
                arcHeaders: [
                    {
                        id: 1,
                        arcclass: 'arc_1',
                        iconarc: '<svg xmlns="http://www.w3.org/2000/svg" width="617" height="306" viewBox="0 0 617 306" fill="none"><path d="M604.848 268.271C579.921 236.946 552.249 207.629 523.578 179.823C486.775 144.13 447.777 115.908 403.494 90.4544C338.535 53.116 271.515 18.3483 195.62 13.6771C153.942 11.1119 101.362 14.2172 67.8029 43.006C44.158 63.2899 24.0615 97.6956 18.3741 128.689C8.6137 181.879 13.8255 239.076 13.8255 293.146" stroke="url(#paint0_linear_2310_11593)" stroke-width="24" stroke-linecap="round"/><defs><linearGradient id="paint0_linear_2310_11593" x1="165.5" y1="2.06808e-05" x2="482.473" y2="131.565" gradientUnits="userSpaceOnUse"><stop stop-color="#F5D6FC"/><stop offset="1" stop-color="white" stop-opacity="0"/></linearGradient></defs></svg>'
                    },
                    {
                        id: 2,
                        arcclass: 'arc_2',
                        iconarc: '<svg xmlns="http://www.w3.org/2000/svg" width="617" height="305" viewBox="0 0 617 305" fill="none"><path d="M604.953 267.312C580.027 235.987 552.354 206.67 523.684 178.864C486.881 143.171 447.882 114.949 403.599 89.4954C338.641 52.157 271.62 17.3893 195.726 12.7182C154.047 10.1529 101.467 13.2582 67.9083 42.047C44.2634 62.3309 24.167 96.7366 18.4795 127.73C8.71917 180.92 13.931 238.117 13.931 292.187" stroke="url(#paint0_linear_2310_11591)" stroke-width="24" stroke-linecap="round"/><defs><linearGradient id="paint0_linear_2310_11591" x1="213" y1="24.5" x2="547.489" y2="216.519" gradientUnits="userSpaceOnUse"><stop stop-color="white"/><stop offset="1" stop-color="#E5BA39" stop-opacity="0"/></linearGradient></defs></svg>'
                    }
                ],
                stepsDev: [
                    {
                        id: 1,
                        number: 'Шаг 1',
                        title: 'Анализ',
                        iconstep: '<svg xmlns="http://www.w3.org/2000/svg" width="67" height="67" viewBox="0 0 67 67" fill="none"><g clip-path="url(#clip0_2440_6483)"><path d="M31.4629 66.2119L0.853125 35.5365C-0.263542 34.4198 -0.263542 32.5806 0.853125 31.4639L31.4629 0.854102C32.5796 -0.262565 34.4188 -0.262565 35.5355 0.854102L66.1453 31.4639C67.2619 32.5806 67.2619 34.4198 66.1453 35.5365L35.5355 66.1463C34.4188 67.3286 32.5796 67.3286 31.4629 66.2119Z" fill="#DF40FF"/></g><defs><clipPath id="clip0_2440_6483"><rect width="67" height="67" fill="white"/></clipPath></defs></svg>',
                        description: 'Оценка текущего состояния продукта через анализ данных и выявление потребностей бизнеса в доработках'
                    },
                    {
                        id: 2,
                        number: 'Шаг 2',
                        title: 'Прототип',
                        description: 'Создание концепции изменений, включая UI/UX функциональных и пользовательских улучшений, а также разработка прототипа'
                    },
                    {
                        id: 3,
                        number: 'Шаг 3',
                        title: 'Маркетинг',
                        iconstep: '<svg xmlns="http://www.w3.org/2000/svg" width="68" height="67" viewBox="0 0 68 67" fill="none"><g clip-path="url(#clip0_2497_5853)"><path d="M32.1781 4.9267L0.583045 59.5777C-0.139504 60.8914 0.780104 62.4679 2.29089 62.4679H65.4154C66.9262 62.4679 67.8458 60.8257 67.1232 59.5777L35.5281 4.9267C34.7399 3.61297 32.9007 3.61297 32.1781 4.9267Z" fill="#E5BA39"/></g><defs><clipPath id="clip0_2497_5853"><rect width="67" height="67" fill="white" transform="translate(0.333984)"/></clipPath></defs></svg>',
                        description: 'Разработка стратегии маркетинга для представления улучшенного продукта на рынке и среди пользователей'
                    },
                    {
                        id: 4,
                        number: 'Шаг 4',
                        title: 'Дизайн',
                        iconstep: '<svg xmlns="http://www.w3.org/2000/svg" width="68" height="67" viewBox="0 0 68 67" fill="none"><g clip-path="url(#clip0_2440_6351)"><path d="M33.832 66.9995C52.3336 66.9995 67.332 52.001 67.332 33.4995C67.332 14.998 52.3336 -0.000488281 33.832 -0.000488281C15.3305 -0.000488281 0.332031 14.998 0.332031 33.4995C0.332031 52.001 15.3305 66.9995 33.832 66.9995Z" fill="#3377FF"/></g><defs><clipPath id="clip0_2440_6351"><rect width="67" height="67" fill="white" transform="translate(0.333008)"/></clipPath></defs></svg>',
                        description: 'Разработка интерфейса, который не только отражает корпоративный стиль, но и обеспечивает удобство'
                    },
                    {
                        id: 5,
                        number: 'Шаг 5',
                        title: 'Разработка',
                        iconstep: '<svg xmlns="http://www.w3.org/2000/svg" width="67" height="67" viewBox="0 0 67 67" fill="none"><g clip-path="url(#clip0_2440_612)"><path d="M35.4962 2.62794L15.856 64.6358C15.4619 65.8181 16.3815 67.0662 17.6295 67.0662H28.4021C30.0442 67.0662 31.4893 66.0152 31.9491 64.4387L51.5893 2.43088C51.9178 1.24853 51.0638 0.000488281 49.8158 0.000488281H39.0432C37.4011 0.000488281 35.956 1.05147 35.4962 2.62794Z" fill="#FF404E"/></g><defs><clipPath id="clip0_2440_612"><rect width="67" height="67" fill="white"/></clipPath></defs></svg>',
                        description: 'Реализация предложенных изменений, внедрение новых функций и оптимизация кода для повышения производительности'
                    },
                    {
                        id: 6,
                        number: 'Шаг 6',
                        title: 'Тестирование',
                        description: 'Проведение тестирования продукта после доработок для проверки его стабильности и соответствия ожиданиям'
                    },
                ],
                arcFooters: [
                    {
                        id: 1,
                        arcclass: 'arc_3',
                        iconarc: '<svg xmlns="http://www.w3.org/2000/svg" width="617" height="305" viewBox="0 0 617 305" fill="none"><path d="M12 37.6884C36.9262 69.0129 64.5987 98.3301 93.2693 126.136C130.072 161.829 169.071 190.051 213.354 215.505C278.313 252.843 345.333 287.611 421.228 292.282C462.906 294.847 515.486 291.742 549.045 262.953C572.69 242.669 592.786 208.263 598.474 177.27C608.234 124.08 603.022 66.8831 603.022 12.8126" stroke="url(#paint0_linear_2310_11592)" stroke-width="24" stroke-linecap="round"/><defs><linearGradient id="paint0_linear_2310_11592" x1="300" y1="309.5" x2="575.015" y2="96.0188" gradientUnits="userSpaceOnUse"><stop stop-color="#D3E1FC"/><stop offset="1" stop-color="#FF404E" stop-opacity="0"/></linearGradient></defs></svg>'
                    },
                    {
                        id: 2,
                        arcclass: 'arc_4',
                        iconarc: '<svg xmlns="http://www.w3.org/2000/svg" width="617" height="306" viewBox="0 0 617 306" fill="none"><path d="M12.5879 37.7294C37.5141 69.0539 65.1866 98.3711 93.8572 126.177C130.66 161.87 169.659 190.092 213.942 215.546C278.9 252.884 345.921 287.652 421.815 292.323C463.494 294.888 516.074 291.783 549.633 262.994C573.278 242.71 593.374 208.304 599.061 177.311C608.822 124.121 603.61 66.9241 603.61 12.8536" stroke="url(#paint0_linear_2310_11594)" stroke-width="24" stroke-linecap="round"/><defs><linearGradient id="paint0_linear_2310_11594" x1="359" y1="293" x2="595" y2="173.5" gradientUnits="userSpaceOnUse"><stop stop-color="#FCD6D8"/><stop offset="1" stop-color="white" stop-opacity="0"/></linearGradient></defs></svg>'
                    }
                ],
            },
        };
    },
};
</script>

<template>
    <TheHeader />

    <main class="modification">

        <PageTitle pageTitle="Доработка и модернизация IT-продукта"
            pageDescription="Экспертное обновление продукта для улучшения функциональности, производительности и удовлетворения потребностей клиентов"
            pageIcon='<svg xmlns="http://www.w3.org/2000/svg" width="476" height="640" viewBox="0 0 476 640" fill="none"><path d="M324.516 8.96461C325.293 6.35151 326.9 4.06279 329.094 2.44528C331.289 0.827778 333.951 -0.0303992 336.677 0.00082273H429.95C432.591 0.0191587 435.192 0.655732 437.544 1.85954C439.896 3.06334 441.933 4.80097 443.493 6.93334C445.052 9.06572 446.091 11.5336 446.526 14.1394C446.961 16.7453 446.779 19.4168 445.997 21.94L425.938 85.313C425.06 88.0657 423.49 90.5467 421.378 92.518C419.266 94.4894 416.682 95.8849 413.876 96.5708C411.069 97.2567 408.134 97.21 405.35 96.4351C402.567 95.6602 400.029 94.1831 397.981 92.1455L327.65 21.8774C325.97 20.2349 324.786 18.1535 324.232 15.8703C323.677 13.5872 323.776 11.1944 324.516 8.96461ZM152.011 554.311L131.952 618.122C131.168 620.642 130.985 623.311 131.42 625.914C131.854 628.517 132.894 630.982 134.455 633.11C136.016 635.238 138.055 636.97 140.407 638.167C142.76 639.363 145.36 639.991 147.999 639.999H241.272C243.99 640.034 246.646 639.185 248.839 637.58C251.033 635.974 252.645 633.699 253.433 631.098C254.173 628.868 254.272 626.475 253.717 624.192C253.163 621.909 251.979 619.828 250.299 618.185L179.968 547.854C177.949 545.795 175.434 544.29 172.665 543.484C169.896 542.679 166.966 542.599 164.157 543.254C161.348 543.909 158.755 545.276 156.628 547.224C154.501 549.171 152.911 551.633 152.011 554.373V554.311ZM195.576 31.5306C150.03 46.3397 108.635 71.7171 74.7746 105.588C40.9144 139.459 15.5504 180.862 0.756001 226.413C-0.356991 230.004 -0.238211 233.864 1.09345 237.379C2.4251 240.894 4.89314 243.864 8.10574 245.816C11.3183 247.768 15.0911 248.591 18.8247 248.153C22.5583 247.715 26.0387 246.043 28.7128 243.401L212.563 59.5501C215.205 56.876 216.878 53.3957 217.316 49.6621C217.753 45.9285 216.931 42.1558 214.979 38.9432C213.027 35.7306 210.057 33.2623 206.542 31.9307C203.026 30.599 199.167 30.4803 195.576 31.5932V31.5306ZM382.373 608.218C427.912 593.416 469.303 568.048 503.163 534.188C537.022 500.328 562.39 458.938 577.193 413.398C578.37 409.796 578.296 405.902 576.98 402.348C575.665 398.794 573.187 395.79 569.949 393.822C566.71 391.854 562.902 391.039 559.141 391.509C555.381 391.979 551.891 393.707 549.236 396.411L365.386 580.262C362.809 582.948 361.193 586.411 360.791 590.112C360.388 593.812 361.222 597.542 363.161 600.719C365.1 603.897 368.037 606.343 371.512 607.677C374.987 609.01 378.806 609.157 382.373 608.093V608.218ZM93.2141 517.139L100.548 493.758C102.422 487.892 102.641 481.622 101.181 475.639C99.7215 469.655 96.6393 464.191 92.2739 459.847L28.7128 396.286C26.0263 393.633 22.5275 391.959 18.7767 391.532C15.026 391.104 11.2402 391.947 8.02558 393.927C4.811 395.906 2.35365 398.907 1.04696 402.449C-0.259732 405.99 -0.340218 409.868 0.818555 413.461C14.0792 454.24 35.8512 491.738 64.693 523.47C66.6931 525.654 69.2332 527.273 72.0577 528.164C74.8821 529.054 77.8913 529.185 80.7824 528.544C83.6736 527.902 86.3447 526.51 88.527 524.508C90.7093 522.506 92.3259 519.965 93.2141 517.139ZM484.735 122.923L477.401 146.241C475.529 152.118 475.31 158.397 476.77 164.39C478.229 170.382 481.31 175.858 485.675 180.216L549.236 243.714C551.923 246.366 555.422 248.04 559.172 248.468C562.923 248.896 566.709 248.052 569.923 246.073C573.138 244.094 575.595 241.093 576.902 237.551C578.209 234.009 578.289 230.132 577.13 226.539C563.853 185.786 542.082 148.312 513.256 116.592C511.256 114.408 508.716 112.789 505.891 111.899C503.067 111.008 500.058 110.877 497.167 111.519C494.275 112.161 491.604 113.553 489.422 115.555C487.24 117.556 485.623 120.098 484.735 122.923ZM306.839 543.78L512.566 337.739C514.935 335.406 516.817 332.625 518.101 329.558C519.385 326.491 520.046 323.199 520.046 319.874C520.046 316.549 519.385 313.258 518.101 310.191C516.817 307.124 514.935 304.343 512.566 302.01L306.839 96.2826C304.506 93.9136 301.725 92.0322 298.658 90.748C295.591 89.4638 292.299 88.8025 288.974 88.8025C285.649 88.8025 282.358 89.4638 279.291 90.748C276.224 92.0322 273.443 93.9136 271.11 96.2826L65.3826 302.01C63.0136 304.343 61.1323 307.124 59.8481 310.191C58.5639 313.258 57.9024 316.549 57.9024 319.874C57.9024 323.199 58.5639 326.491 59.8481 329.558C61.1323 332.625 63.0136 335.406 65.3826 337.739L271.11 543.466C273.443 545.835 276.224 547.717 279.291 549.001C282.358 550.285 285.649 550.946 288.974 550.946C292.299 550.946 295.591 550.285 298.658 549.001C301.725 547.717 304.506 545.835 306.839 543.466V543.78Z" fill="#E0E0E0"/></svg>' />

        <TheSpotsFore pageSlogan="Инновации — модернизация — результаты" />

        <div class="wrapper">

            <div class="content product_dev">
                <h4 class="product_h4">Интеллектуальное преобразование</h4>
                <PageSteps :dataSteps="pageData"/>
            </div>

            <div class="content">
                <div class="service_description">
                    <h2>Мониторинг и поддержка</h2>
                    <p>
                        Регулярный мониторинг производительности искусственного интеллекта, а также оперативная поддержка,
                        обеспечивают стабильную и эффективную работу системы
                    </p>
                </div>
            </div>
            
        </div>

    </main>

    <TheFooter />
</template>

