import { defineStore } from 'pinia'

export const DataServices = defineStore('data-services', {
    state: () => ({
        applicationSers: [
            {
                id: 1,
                heading: 'Разработка приложений для бизнеса',
                subtitle: 'IT-решения для оптимизации работы компании, улучшения производительности и сокращения затрат',
                sectionicon: '<svg xmlns="http://www.w3.org/2000/svg" width="325" height="319" viewBox="0 0 325 319" fill="none"><path d="M320.738 168.317L206.296 282.758C204.97 284.068 203.245 284.899 201.393 285.117C199.542 285.336 197.671 284.931 196.076 283.966C194.481 283.001 193.254 281.532 192.589 279.79C191.923 278.049 191.858 276.136 192.403 274.353L248.831 95.9661C249.261 94.5974 250.037 93.3628 251.083 92.3815C252.13 91.4002 253.412 90.7054 254.805 90.3642C256.199 90.023 257.657 90.047 259.038 90.4337C260.42 90.8205 261.678 91.5571 262.692 92.5722L320.738 150.618C323.043 152.986 324.333 156.162 324.333 159.467C324.333 162.773 323.043 165.948 320.738 168.317ZM118.815 36.1443L4.37369 150.618C2.068 152.986 0.777832 156.162 0.777832 159.467C0.777832 162.773 2.068 165.948 4.37369 168.317L62.4193 226.362C63.433 227.377 64.6915 228.114 66.073 228.501C67.4545 228.888 68.9124 228.912 70.3059 228.57C71.6994 228.229 72.9813 227.534 74.0279 226.553C75.0744 225.572 75.8503 224.337 76.2804 222.968L132.708 44.5816C133.265 42.7966 133.209 40.8766 132.548 39.1275C131.887 37.3783 130.659 35.9007 129.061 34.9301C127.463 33.9596 125.586 33.5518 123.729 33.7719C121.872 33.9919 120.142 34.8271 118.815 36.1443ZM212.957 0.777832H193.926C190.386 0.78934 186.941 1.9265 184.09 4.02483C181.239 6.12316 179.129 9.07393 178.066 12.4504L90.4587 288.912C89.54 291.828 89.4387 294.94 90.1657 297.91C90.8927 300.879 92.4203 303.593 94.5821 305.755L103.305 314.477C104.467 315.638 105.847 316.558 107.365 317.184C108.884 317.81 110.512 318.13 112.154 318.125H131.186C134.723 318.121 138.167 316.99 141.018 314.897C143.87 312.804 145.981 309.857 147.045 306.484L234.494 30.0226C235.415 27.1018 235.518 23.9842 234.791 21.009C234.064 18.0338 232.535 15.3149 230.371 13.1482L221.775 4.45723C219.439 2.11122 216.268 0.787921 212.957 0.777832Z" fill="url(#paint0_linear_2325_5076)" /><defs><linearGradient id="paint0_linear_2325_5076" x1="-197.675" y1="-200.764" x2="518.917" y2="515.797" gradientUnits="userSpaceOnUse"><stop stop-color="#F5D6FC" /><stop offset="1" stop-color="#FCD6D8" /></linearGradient></defs></svg>',
                gridclass: 'grid_applications',
                colorclass: 'color_border_applications',
                types: [
                    {
                        url: 'development',
                        title: 'Системы планирования ресурсов предприятия',
                        description: 'Внедрение и поддержка индивидуализированных систем планирования ресурсов предприятия (ERP), обеспечивающих комплексное управление бизнес-процессами с оптимизацией операций, повышением эффективности и надежной поддержкой',
                        price: '1 500 000'
                    },
                    {
                        url: 'development',
                        title: 'Управление производством',
                        description: 'Современные технологии для повышения эффективности бизнес-процессов',
                        price: '1 000 000'
                    },
                    {
                        url: 'development',
                        title: 'Системы мониторинга',
                        description: 'Оперативное управления бизнес-процессами в режиме реального времени',
                        price: '500 000'
                    },
                    {
                        url: 'development',
                        title: 'Управление маркетингом и продажами',
                        description: 'Интегрированные решения позволяющие клиентам эффективно планировать, отслеживать и оптимизировать маркетинговые кампании',
                        price: '1 000 000'
                    },
                    {
                        url: 'development',
                        title: 'Управление проектами',
                        description: 'Комплексное управление задачами, ресурсами и сроками проектов',
                        price: '1 000 000'
                    },
                    {
                        url: 'development',
                        title: 'Индивидуальные решения',
                        description: 'Персонализированные и эффективные технологические решения',
                        price: '1 500 000'
                    },
                    {
                        url: 'development',
                        title: 'Разработка аналога иностранного ПО',
                        description: 'Кастомизированные решения, соответствующие уникальным потребностям, а также гарантию соблюдения высоких стандартов качества и функциональности',
                        price: '1 000 000'
                    }
                ]
            },
            {
                id: 2,
                heading: 'Внедрение ИИ',
                subtitle: 'Повышение эффективности через автоматизацию задач, анализ данных, персонализация — лишь малая часть полезных возможностей ИИ',
                sectionicon: '<svg xmlns="http://www.w3.org/2000/svg" width="325" height="312" viewBox="0 0 325 312" fill="none"><path d="M57.0863 223.073L4.35171 170.338C-0.413462 165.573 -0.413462 157.631 4.35171 152.548L150.801 5.78078C157.473 -0.890468 167.956 -0.890468 174.31 5.78078L320.759 152.231C325.525 156.996 325.525 164.938 320.759 170.021L268.343 223.073C264.53 226.885 257.859 226.25 255.318 221.484L173.357 79.7998C168.591 71.5402 156.52 71.5402 151.755 79.7998L70.1112 221.167C67.2521 225.932 60.8985 226.885 57.0863 223.073ZM80.9122 294.233L93.6194 306.94C96.7961 310.117 100.926 311.705 105.373 311.705H219.738C224.185 311.705 228.315 309.799 231.492 306.94L244.199 294.233C249.6 288.832 250.553 280.573 246.74 273.901L169.862 140.476C166.685 134.758 158.743 134.758 155.249 140.476L78.3708 274.219C74.5587 280.573 75.5117 288.832 80.9122 294.233Z" fill="url(#paint0_linear_2400_5150)"/><defs><linearGradient id="paint0_linear_2400_5150" x1="-195.738" y1="-174.19" x2="492.198" y2="512.411" gradientUnits="userSpaceOnUse"><stop stop-color="#F5D6FC"/><stop offset="1" stop-color="#FCF2D3"/></linearGradient></defs></svg>',
                gridclass: 'grid_ii',
                colorclass: 'color_border_ii',
                types: [
                    {
                        url: 'ii',
                        title: 'Анализ и управление данными',
                        description: 'Передовые методы обработки данных, прогнозирования и принятия решений для оптимизации бизнес-процессов и повышения эффективности',
                        price: '700 000'
                    },
                    {
                        url: 'ii',
                        title: 'Машинное зрение',
                        description: 'Автоматизированное распознавание и анализ визуальных данных, оптимизированные процессы контроля и мониторинга',
                        price: '400 000'
                    },
                    {
                        url: 'ii',
                        title: 'Чат-боты на основе ИИ',
                        description: 'Виртуальные ассистенты, способные отвечать на вопросы, предоставлять информацию и оптимизировать коммуникацию',
                        price: '700 000'
                    },
                    {
                        url: 'ii',
                        title: 'Биометрия',
                        description: 'Высокоточная идентификации по биологическим характеристикам',
                        price: '700 000'
                    },
                    {
                        url: 'ii',
                        title: 'Видеоаналитика',
                        description: 'Эффективный мониторинг и принятие оперативных решений на основе визуальной информации',
                        price: '700 000'
                    },
                    {
                        url: 'ii',
                        title: 'Системы помощи принятия решений',
                        description: 'Анализ данных и предоставление рекомендаций на основе сложных алгоритмов и данных',
                        price: '700 000'
                    }
                ]
            },
            {
                id: 3,
                heading: 'Доработка и модернизация IT-продукта',
                subtitle: 'Экспертное обновление продукта для улучшения функциональности, производительности и удовлетворения потребностей клиентов',
                sectionicon: '<svg xmlns="http://www.w3.org/2000/svg" width="294" height="325" viewBox="0 0 294 325" fill="none"><path d="M164.95 5.30945C165.342 3.98839 166.155 2.83131 167.264 2.01357C168.374 1.19583 169.72 0.761975 171.098 0.77776H218.252C219.588 0.78703 220.903 1.10885 222.092 1.71744C223.281 2.32603 224.311 3.2045 225.099 4.28253C225.888 5.36057 226.413 6.60819 226.633 7.9256C226.852 9.24301 226.761 10.5936 226.365 11.8692L216.224 43.9078C215.78 45.2994 214.987 46.5537 213.919 47.5503C212.851 48.547 211.545 49.2525 210.126 49.5992C208.707 49.946 207.223 49.9224 205.816 49.5306C204.409 49.1389 203.126 48.3921 202.09 47.362L166.534 11.8376C165.685 11.0072 165.086 9.95492 164.806 8.80069C164.526 7.64645 164.576 6.43674 164.95 5.30945ZM77.739 281.012L67.5982 313.273C67.2014 314.546 67.1091 315.896 67.3289 317.212C67.5486 318.528 68.0743 319.774 68.8634 320.85C69.6526 321.926 70.6833 322.801 71.8726 323.406C73.0619 324.011 74.3765 324.328 75.7108 324.332H122.866C124.24 324.35 125.582 323.921 126.691 323.109C127.8 322.298 128.615 321.148 129.013 319.832C129.387 318.705 129.437 317.495 129.157 316.341C128.877 315.187 128.278 314.135 127.429 313.304L91.8727 277.748C90.852 276.707 89.5805 275.946 88.1805 275.539C86.7805 275.131 85.2993 275.091 83.8793 275.423C82.4594 275.754 81.1486 276.445 80.0731 277.429C78.9977 278.414 78.1939 279.659 77.739 281.044V281.012ZM99.7635 16.7178C76.7374 24.2046 55.8099 37.0343 38.6916 54.158C21.5734 71.2817 8.75051 92.2134 1.27112 115.242C0.708437 117.057 0.768487 119.008 1.44171 120.786C2.11494 122.563 3.36267 124.064 4.98682 125.051C6.61096 126.038 8.51833 126.454 10.4059 126.232C12.2934 126.011 14.0529 125.166 15.4048 123.83L108.352 30.8832C109.687 29.5313 110.533 27.7718 110.754 25.8843C110.975 23.9967 110.559 22.0894 109.573 20.4653C108.586 18.8411 107.084 17.5933 105.307 16.9201C103.53 16.2469 101.579 16.1868 99.7635 16.7495V16.7178ZM194.2 308.266C217.222 300.782 238.148 287.957 255.266 270.839C272.384 253.721 285.208 232.796 292.692 209.773C293.287 207.952 293.249 205.983 292.585 204.187C291.92 202.39 290.667 200.871 289.03 199.876C287.392 198.881 285.467 198.469 283.566 198.707C281.665 198.945 279.9 199.818 278.558 201.185L185.612 294.132C184.309 295.49 183.492 297.241 183.289 299.112C183.085 300.982 183.507 302.868 184.487 304.474C185.467 306.081 186.952 307.317 188.709 307.992C190.466 308.666 192.396 308.74 194.2 308.202V308.266ZM48.0138 262.22L51.7215 250.4C52.6689 247.434 52.7797 244.264 52.0417 241.239C51.3037 238.214 49.7455 235.452 47.5385 233.255L15.4048 201.122C14.0467 199.781 12.2778 198.935 10.3816 198.718C8.48537 198.502 6.57144 198.929 4.94629 199.929C3.32115 200.93 2.07882 202.447 1.41821 204.237C0.757607 206.028 0.716917 207.988 1.30274 209.805C8.00675 230.421 19.0137 249.378 33.5948 265.421C34.606 266.525 35.8902 267.343 37.3181 267.793C38.746 268.244 40.2673 268.31 41.7289 267.985C43.1905 267.661 44.5409 266.957 45.6442 265.945C46.7475 264.933 47.5648 263.648 48.0138 262.22ZM245.949 62.9218L242.242 74.7105C241.295 77.6816 241.185 80.8558 241.923 83.8855C242.66 86.9151 244.218 89.6832 246.425 91.8864L278.558 123.988C279.917 125.329 281.685 126.175 283.582 126.392C285.478 126.608 287.392 126.182 289.017 125.181C290.642 124.18 291.884 122.663 292.545 120.873C293.206 119.082 293.246 117.122 292.66 115.305C285.948 94.7023 274.942 75.7573 260.368 59.7211C259.357 58.617 258.073 57.7986 256.645 57.3483C255.217 56.8981 253.696 56.8319 252.234 57.1563C250.773 57.4808 249.422 58.1845 248.319 59.1966C247.216 60.2087 246.398 61.4935 245.949 62.9218ZM156.013 275.688L260.02 171.523C261.217 170.344 262.168 168.938 262.818 167.387C263.467 165.837 263.801 164.173 263.801 162.492C263.801 160.811 263.467 159.147 262.818 157.596C262.168 156.045 261.217 154.64 260.02 153.46L156.013 49.4536C154.834 48.2559 153.428 47.3047 151.877 46.6555C150.327 46.0063 148.662 45.6719 146.982 45.6719C145.301 45.6719 143.636 46.0063 142.086 46.6555C140.535 47.3047 139.129 48.2559 137.95 49.4536L33.9435 153.46C32.7458 154.64 31.7947 156.045 31.1455 157.596C30.4962 159.147 30.1618 160.811 30.1618 162.492C30.1618 164.173 30.4962 165.837 31.1455 167.387C31.7947 168.938 32.7458 170.344 33.9435 171.523L137.95 275.53C139.129 276.727 140.535 277.679 142.086 278.328C143.636 278.977 145.301 279.311 146.982 279.311C148.662 279.311 150.327 278.977 151.877 278.328C153.428 277.679 154.834 276.727 156.013 275.53V275.688Z" fill="url(#paint0_linear_2400_5212)"/><defs><linearGradient id="paint0_linear_2400_5212" x1="-195.001" y1="-196.127" x2="518.823" y2="484.445" gradientUnits="userSpaceOnUse"><stop stop-color="#D3E1FC"/><stop offset="0.5" stop-color="#F5D6FC"/><stop offset="1" stop-color="#FCD6D8"/></linearGradient></defs></svg>',
                gridclass: 'grid_modification',
                colorclass: 'color_border_modification',
                types: [
                    {
                        url: 'modification',
                        title: 'Оптимизация производительности',
                        description: 'Современные технологии и решения для улучшения и повышения эффективности работы продукта',
                        price: '500 000'
                    },
                    {
                        url: 'modification',
                        title: 'Поддержка',
                        description: 'Оперативное реагирование на запросы, обновление и оптимизацию функциональности',
                        price: '250 000'
                    },
                    {
                        url: 'modification',
                        title: 'Исправление ошибок',
                        description: 'Выявление, анализ и устранение программных ошибок',
                        price: '250 000'
                    },
                    {
                        url: 'modification',
                        title: 'Доработка функционала',
                        description: 'Внедрение новых возможностей, улучшений и оптимизация программного продукта',
                        price: '1 500 000'
                    }
                ]
            },
            {
                id: 4,
                heading: 'Создание MVP',
                subtitle: 'Быстро и эффективно выведем ваш проект на рынок с минимальными затратами и максимальной отдачей',
                gridclass: 'grid_mvp',
                colorclass: 'color_border_mvp',
                types: [
                    {
                        url: 'mvp',
                        title: 'Проведение cust dev',
                        description: 'Выявление и анализ потребностей пользователей, что позволяет точно определить ключевые функции и характеристики MVP',
                        price: '400 000'
                    },
                    {
                        url: 'mvp',
                        title: 'UI/UX',
                        description: 'Быстрое  внедрение базовой версии продукта на рынок для проверки гипотез и сбора обратной связи от пользователей',
                        price: '500 000'
                    },
                    {
                        url: 'mvp',
                        title: 'Разработка',
                        description: 'Создание базовой функциональности и структуры продукта, достаточной для успешного запуска и тестирования на рынке',
                        price: '500 000'
                    },
                ]
            },
        ]
    })
})